{
    "0": {
        "name": "Apple - Apple Scab",
        "treatment": "Apple scab can be managed through a combination of cultural practices and fungicide applications. Prune and remove infected leaves and branches in the fall to reduce the number of spores in the next season. Apply fungicides like Captan or Sulfur during the early spring when new leaves are forming. Ensure proper air circulation by thinning the tree to allow quicker drying of leaves."
    },
    "1": {
        "name": "Apple - Black Rot",
        "treatment": "To control black rot in apple trees, remove and destroy all infected fruits and fallen debris during the growing season. Prune out dead or cankered wood, and avoid injuries to the tree as they can allow the fungus to enter. Applying copper-based fungicides before symptoms appear can help prevent further spread of the disease. Additionally, avoid overhead watering to keep the foliage dry."
    },
    "2": {
        "name": "Apple - Cedar Apple Rust",
        "treatment": "Managing cedar apple rust involves removing nearby cedar trees if possible, as they serve as alternate hosts for the fungus. In early spring, apply fungicides like myclobutanil or mancozeb to protect apple trees, particularly during wet weather. Resistant apple varieties can also be planted to reduce the likelihood of infection."
    },
    "3": {
        "name": "Apple - Healthy",
        "treatment": "No treatment is necessary. To maintain health, regularly inspect the tree for signs of disease, prune it to ensure good air circulation, and apply fertilizers as needed."
    },
    "4": {
        "name": "Blueberry - Healthy",
        "treatment": "No treatment required. Ensure proper watering, avoid waterlogging the soil, and maintain appropriate soil acidity (pH 4.5 to 5.5) for continued plant health."
    },
    "5": {
        "name": "Cherry - Powdery Mildew",
        "treatment": "Powdery mildew can be controlled by applying sulfur-based fungicides or horticultural oils like neem oil. Prune infected parts and ensure good air circulation around the plant. Water the plants at their base rather than from above, as powdery mildew thrives in humid conditions. Regularly inspect for symptoms during dry seasons, and apply fungicides preventively."
    },
    "6": {
        "name": "Cherry - Healthy",
        "treatment": "No treatment required. Proper watering and pruning will help keep the tree healthy. Monitor regularly for pests or signs of disease."
    },
    "7": {
        "name": "Corn (Maize) - Cercospora Leaf Spot & Gray Leaf Spot",
        "treatment": "Gray leaf spot can be managed by practicing crop rotation and removing plant debris after harvest. Use resistant varieties when possible, and apply fungicides like strobilurins or triazoles at the first sign of disease. Ensure adequate spacing between plants to promote airflow, reducing moisture on leaves."
    },
    "8": {
        "name": "Corn (Maize) - Common Rust",
        "treatment": "Common rust can be managed by planting resistant corn hybrids. If the disease is severe, fungicides like mancozeb or azoxystrobin can be applied early when symptoms first appear. Ensure proper crop rotation and eliminate infected debris to reduce future outbreaks."
    },
    "9": {
        "name": "Corn (Maize) - Northern Leaf Blight",
        "treatment": "To control northern leaf blight, plant resistant varieties and use a crop rotation system to minimize the buildup of the fungus in the soil. Apply fungicides like azoxystrobin or pyraclostrobin when lesions first appear, especially in wet and humid conditions."
    },
    "10": {
        "name": "Corn (Maize) - Healthy",
        "treatment": "No treatment required. Ensure proper crop management, including irrigation and nutrient balance, for continued health."
    },
    "11": {
        "name": "Grape - Black Rot",
        "treatment": "Black rot in grapes can be managed by removing all infected leaves and fruit. Prune the vine to increase air circulation, and apply fungicides such as mancozeb or myclobutanil early in the growing season before symptoms appear. Keeping the vineyard floor clean from plant debris can also reduce the chances of infection."
    },
    "12": {
        "name": "Grape - Esca (Black Measles)",
        "treatment": "Esca disease is difficult to manage once it becomes established. Pruning infected vines, especially during dry weather, can help slow its spread. Copper-based fungicides may provide some control, but prevention is best achieved by avoiding wounds to the vine and maintaining overall vine health with proper irrigation and fertilization."
    },
    "13": {
        "name": "Grape - Leaf Blight (Isariopsis Leaf Spot)",
        "treatment": "Leaf blight in grapes can be controlled by removing infected leaves and applying copper or sulfur-based fungicides. Ensure the vineyard has good airflow to reduce leaf wetness, and practice proper sanitation by removing plant debris from the ground."
    },
    "14": {
        "name": "Grape - Healthy",
        "treatment": "No treatment required. Maintain proper pruning and irrigation to keep grapevines healthy."
    },
    "15": {
        "name": "Orange - Huanglongbing (Citrus Greening)",
        "treatment": "There is no known cure for citrus greening. Infected trees should be removed to prevent the spread to healthy trees. The disease is spread by an insect called the Asian citrus psyllid, so controlling its population with insecticides can help reduce the spread. Regular monitoring and planting disease-free stock are essential."
    },
    "16": {
        "name": "Peach - Bacterial Spot",
        "treatment": "Bacterial spot can be controlled by applying copper-based bactericides early in the season. Ensure good air circulation by pruning trees properly and avoid overhead irrigation. Resistant varieties can also be planted to reduce the risk of infection."
    },
    "17": {
        "name": "Peach - Healthy",
        "treatment": "No treatment required. Regular pruning and proper fertilization will help maintain a healthy peach tree."
    },
    "18": {
        "name": "Pepper (Bell) - Bacterial Spot",
        "treatment": "Bacterial spot in bell peppers can be managed by using copper-based bactericides and practicing crop rotation. Avoid overhead watering and ensure proper plant spacing to promote airflow. Remove and destroy infected plants to prevent further spread."
    },
    "19": {
        "name": "Pepper (Bell) - Healthy",
        "treatment": "No treatment required. Maintain proper watering and spacing to keep plants healthy."
    },
    "20": {
        "name": "Potato - Early Blight",
        "treatment": "Early blight can be controlled by applying fungicides like chlorothalonil or mancozeb at the first sign of disease. Crop rotation and proper removal of plant debris after harvest are also important practices to reduce disease spread."
    },
    "21": {
        "name": "Potato - Late Blight",
        "treatment": "Late blight can be managed by planting resistant potato varieties and applying fungicides like copper-based sprays or chlorothalonil. Remove infected plants immediately and practice crop rotation to avoid reinfection in future seasons."
    },
    "22": {
        "name": "Potato - Healthy",
        "treatment": "No treatment required. Maintain healthy soil and monitor for early signs of disease."
    },
    "23": {
        "name": "Raspberry - Healthy",
        "treatment": "No treatment required. Regular pruning and monitoring will help keep plants healthy."
    },
    "24": {
        "name": "Soybean - Healthy",
        "treatment": "No treatment required. Monitor for pests or diseases and apply appropriate treatments if needed."
    },
    "25": {
        "name": "Squash - Powdery Mildew",
        "treatment": "Powdery mildew on squash can be managed by applying fungicides such as sulfur or potassium bicarbonate. Water at the base of the plants and ensure good air circulation to minimize humidity around the leaves."
    },
    "26": {
        "name": "Strawberry - Leaf Scorch",
        "treatment": "Leaf scorch in strawberries can be controlled by removing infected leaves and applying fungicides like captan or myclobutanil. Keep plants well-spaced and avoid overhead watering to prevent the spread of the disease."
    },
    "27": {
        "name": "Strawberry - Healthy",
        "treatment": "No treatment required. Ensure proper irrigation and fertilization to maintain plant health."
    },
    "28": {
        "name": "Tomato - Bacterial Spot",
        "treatment": "Bacterial spot on tomatoes can be controlled with copper-based bactericides. Remove and destroy infected leaves, and avoid working with plants when they are wet. Use drip irrigation instead of overhead watering to reduce leaf wetness."
    },
    "29": {
        "name": "Tomato - Early Blight",
        "treatment": "Apply fungicides like chlorothalonil or mancozeb. Practice crop rotation and remove infected plant debris after the growing season."
    },
    "30": {
        "name": "Tomato - Late Blight",
        "treatment": "Apply fungicides with copper or chlorothalonil. Remove and destroy infected plants."
    },
    "31": {
        "name": "Tomato - Leaf Mold",
        "treatment": "Improve air circulation by pruning and spacing plants. Apply fungicides like chlorothalonil or copper-based sprays."
    },
    "32": {
        "name": "Tomato - Septoria Leaf Spot",
        "treatment": "Use fungicides containing chlorothalonil or copper. Remove infected leaves and avoid overhead watering."
    },
    "33": {
        "name": "Tomato - Spider Mites (Two-spotted Spider Mite)",
        "treatment": "Spray plants with water or insecticidal soap. Use horticultural oils to smother the mites."
    },
    "34": {
        "name": "Tomato - Target Spot",
        "treatment": "Use fungicides like chlorothalonil or copper. Remove affected leaves and improve air circulation."
    },
    "35": {
        "name": "Tomato - Tomato Yellow Leaf Curl Virus",
        "treatment": "Control whiteflies that spread the virus. Remove infected plants and use virus-resistant varieties."
    },
    "36": {
        "name": "Tomato - Tomato Mosaic Virus",
        "treatment": "Remove and destroy infected plants. Disinfect tools and practice crop rotation."
    },
    "37": {
        "name": "Tomato - Healthy",
        "treatment": "No treatment needed. Maintain proper care for healthy growth."
    }
}